; domain
(define (domain DesignEnvP)   
  (:requirements :typing :action-costs)  

 (:types node)
	(:functions
	  (total-cost)
	 )
(:predicates
       (connectHard ?src - node ?target - node)
	   (connectEasy ?src - node ?target - node)
       (connectMeduim ?src - node ?target - node)
	   (at ?src - node)
	   (visited ?target - node)
)

(:constants
    node1 node2 node3 node4 node5 node6 node7 node8 node9 node10 node11 node12 - node
)

(:action moveMeduim
    :parameters  (?src - node ?target - node)
    :precondition(and   (connectMeduim ?src ?target)(at ?src))
    :effect (and  (at ?target) (not (at ?src))(visited ?target) (increase (total-cost) 5))

	)
	
(:action moveHard
    :parameters( ?src - node ?target - node)
    :precondition(and  (connectHard ?src ?target )(at ?src) )
    :effect (and  (at ?target) (not (at ?src)) (visited ?target)(increase (total-cost) 8))
	)


(:action moveEazy
    :parameters (?src - node ?target - node)
    :precondition(and  (connectEasy ?src ?target)(at ?src) )
    :effect (and  (at ?target) (not (at ?src))(visited ?target) (increase (total-cost) 1))
	)
	
)

; problem
(define (problem DesignEnvP1)
  (:domain DesignEnvP)
(:init
  (= (total-cost) 0)
	(connectMeduim node10 node6)
	(connectEasy node1 node2)
	(connectMeduim node6 node5)
	(connectEasy node8 node12)
	(connectEasy node4 node3)

	(connectMeduim node6 node2)
	(connectEasy node2 node3)
	(connectEasy node5 node1)
	(connectEasy node9 node5)
	(connectEasy node8 node4)
	(connectMeduim node7 node3)
	(connectMeduim node11 node7)
	(connectEasy node10 node11)
	(connectEasy node12 node11)
	(connectEasy node10 node9)
	(connectMeduim node7 node8)
	(connectMeduim node6 node7)
	
	(connectMeduim node6 node10)
	(connectEasy node2 node1)
	(connectMeduim node5 node6)
	(connectEasy node12 node8)
	(connectEasy node3 node4)
	(connectMeduim node2 node6)

	(connectEasy node3 node2)
	(connectEasy node1 node5)
	(connectEasy node5 node9)
	(connectEasy node4 node8)
	(connectMeduim node3 node7)
	(connectMeduim node7 node11)
	(connectEasy node11 node10)
	(connectEasy node11 node12)
	(connectEasy node9 node10)
	(connectMeduim node8 node7)
	(connectMeduim node7 node6)
	(at node4)

)
(:goal (and 
(visited node9)
)
)
 (:metric minimize (total-cost))


)

; plan
1. (moveeazy node4 node3)
   deleted: (at node4)
   added: (at node3) (visited node3)
   goals met: 0 of 1
2. (moveeazy node3 node2)
   deleted: (at node3)
   added: (at node2) (visited node2)
   goals met: 0 of 1
3. (moveeazy node2 node1)
   deleted: (at node2)
   added: (at node1) (visited node1)
   goals met: 0 of 1
4. (moveeazy node1 node5)
   deleted: (at node1)
   added: (at node5) (visited node5)
   goals met: 0 of 1
5. (moveeazy node5 node9)
   deleted: (at node5)
   added: (at node9) (visited node9)
   goals met: 1 of 1
